tap "hashicorp/tap"

# CLI Tools
brew "ansible"
brew "asdf"
brew "fzf"
brew "htop"
brew "libvips"
brew "libyaml"
brew "neovim"
brew "openssl"
brew "redis"
brew "ripgrep"
brew "postgresql@17"
brew "starship"
brew "stow"
brew "hashicorp/tap/terraform"
brew "tree"
brew "uv"
brew "xz"
brew "yarn"

# Others


# GNU Utilities
brew "coreutils"

# GUI Applications
cask "brave-browser"
cask "discord"
cask "docker"
cask "balenaetcher"
cask "firefox"
cask "firefox@developer-edition"
cask "flux"
cask "ghostty"
cask "google-chrome"
cask "messenger"
cask "proton-drive"
cask "proton-pass"
cask "protonvpn"
cask "vscodium"
cask "signal"
cask "telegram"
cask "transmission"
cask "virtualbox"
cask "vlc"
cask "whatsapp"

# Fonts
cask "font-jetbrains-mono-nerd-font"
